export const options = [
    {name: 'Поставка стеллажного оборудования, нового и Б/У', value: '1'},
    {name: 'Поставка складской техники, новой и Б/У', value: '2'},
    {name: 'Монтаж, демонтаж стеллажного оборудования', value: '3'},
    {name: 'Переезд склада', value: '4'},
    {name: 'Сервисное обслуживание складского оборудования', value: '5'},
    {name: 'Выкуп складского оборудования', value: '6'},
    {name: 'TRADE-IN', value: '7'},
    {name: 'Промышленный ремонт полов', value: '8'},
    {name: 'Промышленная уборка помещений', value: '9'},
]