export const services = [
    { name: 'Поставка стеллажного оборудования, нового и Б/У', value: '1', description: 'Мы предлагаем широкий ассортимент стеллажного оборудования, как нового, так и бывшего в употреблении, чтобы удовлетворить все ваши потребности в организации хранения.' },
    { name: 'Поставка складской техники, новой и Б/У', value: '2', description: 'Наша компания осуществляет поставку складской техники, включая как новые, так и Б/У модели, обеспечивая надежность и эффективность ваших складских операций.' },
    { name: 'Монтаж, демонтаж стеллажного оборудования', value: '3', description: 'Профессиональный монтаж и демонтаж стеллажного оборудования — это наша специализация. Мы гарантируем качественное выполнение работ с учетом всех требований безопасности.' },
    { name: 'Переезд склада', value: '4', description: 'Организация переезда склада — это сложный процесс, который мы берем на себя. Мы обеспечим быструю и безопасную транспортировку вашего оборудования и товаров.' },
    { name: 'Сервисное обслуживание складского оборудования', value: '5', description: 'Мы предоставляем услуги по сервисному обслуживанию складского оборудования, чтобы гарантировать его бесперебойную работу и продлить срок службы.' },
    { name: 'Выкуп складского оборудования', value: '6', description: 'Наша компания предлагает выгодные условия для выкупа складского оборудования, позволяя вам обновить свой парк техники без лишних затрат.' },
    { name: 'TRADE-IN', value: '7', description: 'Программа TRADE-IN позволяет вам обменять старое оборудование на новое с выгодными условиями, что делает обновление вашего склада более доступным.' },
    { name: 'Промышленный ремонт полов', value: '8', description: 'Мы предлагаем услуги по промышленному ремонту полов, обеспечивая долговечность и безопасность ваших складских и производственных помещений.' },
    { name: 'Промышленная уборка помещений', value: '9', description: 'Наша команда профессионалов осуществляет промышленную уборку помещений, гарантируя чистоту и порядок на вашем складе или производстве.' }
];

